Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Baseline Load Testing
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "Booking Flow Activity"
    flow:
      - post:
          url: "/api/appointments"
          json:
            doctorId: "doc_123"
            doctorName: "Dr. Test"
            department: "Cardiology"
            date: "Aug 25, 2026"
            time: "10:00 AM"
